ХМНПФ_Общее/Documents/уп_ПереводСредствИзРезерваОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПереводСредствИзРезерваОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗастрахованноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_АналитикаРезерваОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_АналитикаРезерваОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_АналитикаРезерваОПСДосрочныеПереходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_АналитикаРезерваОПСДосрочныеПереходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НоминалВзносовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НоминалВзносовОПС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ПереводСредствИзРезерваОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()	
	// ХМНПФ 26.09.2018 ШадринАВ // РассчитатьДокумент() // №1837
КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьДокумент")
Процедура РасшОбщ_РассчитатьДокумент() Экспорт
	Если  ТипРешения = 0 Тогда
		РасшифровкаСуммы.Очистить();
		
		ТабДоговоров =  ДоговорыОПС.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыОПС.ДоговорОПС
		|ПОМЕСТИТЬ ДоговорыОПС
		|ИЗ
		|	&ТабДоговоров КАК ДоговорыОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_АналитикаРезерваОПСОстатки.ТипРезерва,
		|	уп_АналитикаРезерваОПСОстатки.ТипСуммы,
		|	ЕСТЬNULL(уп_АналитикаРезерваОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	уп_АналитикаРезерваОПСОстатки.СуммаКомпенсацииОстаток,
		|	уп_АналитикаРезерваОПСОстатки.СуммаВосполненияОстаток,
		|	уп_АналитикаРезерваОПСОстатки.СуммаВозмещенияОстаток,
		|	уп_АналитикаРезерваОПСОстатки.ДоговорОПС
		|ПОМЕСТИТЬ ОстаткиИКомпенсации
		|ИЗ
		|	РегистрНакопления.уп_АналитикаРезерваОПС.Остатки(
		|			&ДатаДок,
		|			Организация = &Организация
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ДоговорыОПС.ДоговорОПС
		|					ИЗ
		|						ДоговорыОПС)) КАК уп_АналитикаРезерваОПСОстатки
		//|				И ТипРезерва В (&СписокТиповРезерва)) КАК уп_АналитикаРезерваОПСОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиИКомпенсации.ТипРезерва,
		|	ОстаткиИКомпенсации.ТипСуммы,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсации,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаВосполненияОстаток, 0) КАК СуммаВосполнения,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещения
		|ИЗ
		|	ДоговорыОПС КАК ДоговорыОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИКомпенсации КАК ОстаткиИКомпенсации
		|		ПО ДоговорыОПС.ДоговорОПС = ОстаткиИКомпенсации.ДоговорОПС
		|ИТОГИ
		|	СУММА(СуммаОстаток)
		|ПО
		|	ДоговорОПС";
		
		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ТабДоговоров", ТабДоговоров);
		
		СписокТиповРезерва = Новый СписокЗначений;
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.Выплатной);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
		#Вставка
		// +ХМНПФ 26.09.2018 ШадринАВ // РассчитатьДокумент() // №1837
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
		// -ХМНПФ 26.09.2018 ШадринАВ // РассчитатьДокумент() // №1837
		#КонецВставки
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
		Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		
		РезультатЗапроса = Запрос.Выполнить();
		ДоговорыОПС.Очистить();
		
		ВыборкаДоговорОПС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДоговорОПС.Следующий() Цикл
			НовСтрДоговорыОПС = ДоговорыОПС.Добавить();
			НовСтрДоговорыОПС.ДоговорОПС = ВыборкаДоговорОПС.ДоговорОПС;
			НовСтрДоговорыОПС.ЗастрахованноеЛицо = ВыборкаДоговорОПС.ДоговорОПС.Участник;
			НовСтрДоговорыОПС.Сумма = ВыборкаДоговорОПС.СуммаОстаток;
			ВыборкаДетальныеЗаписи = ВыборкаДоговорОПС.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.СуммаОстаток<>0 Тогда
					НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
					НовСтрРасшифровки.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
					НовСтрРасшифровки.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
					НовСтрРасшифровки.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
					НовСтрРасшифровки.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
					//НовСтрРасшифровки.СуммаКомпенсации = ВыборкаДетальныеЗаписи.СуммаКомпенсации;
					//НовСтрРасшифровки.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаВозмещения;
					//НовСтрРасшифровки.СуммаВосполнения = ВыборкаДетальныеЗаписи.СуммаВосполнения;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ТипРешения = 2 Тогда
		РасшифровкаСуммы.Очистить();
		
		ТабДоговоров =  ДоговорыОПС.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыОПС.ДоговорОПС
		|ПОМЕСТИТЬ ДоговорыОПС
		|ИЗ
		|	&ТабДоговоров КАК ДоговорыОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.ТипРезерва,
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.ТипСуммы,
		|	ЕСТЬNULL(уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.СуммаКомпенсацииОстаток,
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.СуммаВосполненияОстаток,
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.СуммаВозмещенияОстаток,
		|	уп_АналитикаРезерваОПСДосрочныеПереходыОстатки.ДоговорОПС
		|ПОМЕСТИТЬ ОстаткиИКомпенсации
		|ИЗ
		|	РегистрНакопления.уп_АналитикаРезерваОПСДосрочныеПереходы.Остатки(
		|			&ДатаДок,
		|			Организация = &Организация
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ДоговорыОПС.ДоговорОПС
		|					ИЗ
		|						ДоговорыОПС)) КАК уп_АналитикаРезерваОПСДосрочныеПереходыОстатки
		//|				И ТипРезерва В (&СписокТиповРезерва)) КАК уп_АналитикаРезерваОПСДосрочныеПереходыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиИКомпенсации.ТипРезерва,
		|	ОстаткиИКомпенсации.ТипСуммы,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсации,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаВосполненияОстаток, 0) КАК СуммаВосполнения,
		|	ЕСТЬNULL(ОстаткиИКомпенсации.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещения
		|ИЗ
		|	ДоговорыОПС КАК ДоговорыОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИКомпенсации КАК ОстаткиИКомпенсации
		|		ПО ДоговорыОПС.ДоговорОПС = ОстаткиИКомпенсации.ДоговорОПС
		|ИТОГИ
		|	СУММА(СуммаОстаток)
		|ПО
		|	ДоговорОПС";
		
		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ТабДоговоров", ТабДоговоров);
		
		СписокТиповРезерва = Новый СписокЗначений;
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.Выплатной);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
		Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		
		РезультатЗапроса = Запрос.Выполнить();
		ДоговорыОПС.Очистить();
		
		ВыборкаДоговорОПС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДоговорОПС.Следующий() Цикл
			НовСтрДоговорыОПС = ДоговорыОПС.Добавить();
			НовСтрДоговорыОПС.ДоговорОПС = ВыборкаДоговорОПС.ДоговорОПС;
			НовСтрДоговорыОПС.ЗастрахованноеЛицо = ВыборкаДоговорОПС.ДоговорОПС.Участник;
			НовСтрДоговорыОПС.Сумма = ВыборкаДоговорОПС.СуммаОстаток;
			ВыборкаДетальныеЗаписи = ВыборкаДоговорОПС.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.СуммаОстаток<>0 Тогда
					НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
					НовСтрРасшифровки.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
					НовСтрРасшифровки.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
					НовСтрРасшифровки.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
					НовСтрРасшифровки.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
					//НовСтрРасшифровки.СуммаКомпенсации = ВыборкаДетальныеЗаписи.СуммаКомпенсации;
					//НовСтрРасшифровки.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаВозмещения;
					//НовСтрРасшифровки.СуммаВосполнения = ВыборкаДетальныеЗаписи.СуммаВосполнения;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ТипРешения = 1 Тогда   // Гарантийное восполнение
		РасшифровкаСуммы.Очистить();
		
		ТабДоговоров =  ДоговорыОПС.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыОПС.ДоговорОПС
		|ПОМЕСТИТЬ ДоговорыОПС
		|ИЗ
		|	&ТабДоговоров КАК ДоговорыОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДФиз)
		|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВзносыФиз,
		|	СУММА(ВЫБОР
		|			КОГДА уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыЮр)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДЮр)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ДопВзносы)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДДопВзносы)
		|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВзносыДоп,
		|	СУММА(ВЫБОР
		|			КОГДА уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ГосПоддержка)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДГосПоддержка)
		|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ГосПоддержка,
		|	СУММА(ВЫБОР
		|			КОГДА уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
		|					ИЛИ уп_РезервыОПСОстатки.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
		|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК МК,
		|	уп_РезервыОПСОстатки.ДоговорОПС
		|ПОМЕСТИТЬ Резервы
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ДоговорыОПС.ДоговорОПС
		|					ИЗ
		|						ДоговорыОПС КАК ДоговорыОПС)
		|				И Организация = &Организация
		|				И ТипРезерва = &РПН) КАК уп_РезервыОПСОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_РезервыОПСОстатки.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_НоминалВзносовОПСОбороты.ДоговорОПС,
		|	СУММА(ВЫБОР
		|			КОГДА уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДФиз)
		|				ТОГДА уп_НоминалВзносовОПСОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НоминалФиз,
		|	СУММА(ВЫБОР
		|			КОГДА уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыЮр)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДЮр)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ДопВзносы)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДДопВзносы)
		|				ТОГДА уп_НоминалВзносовОПСОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НоминалДоп,
		|	СУММА(ВЫБОР
		|			КОГДА уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ГосПоддержка)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДГосПоддержка)
		|				ТОГДА уп_НоминалВзносовОПСОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НоминалГП,
		|	СУММА(ВЫБОР
		|			КОГДА уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
		|					ИЛИ уп_НоминалВзносовОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
		|				ТОГДА уп_НоминалВзносовОПСОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НоминалМК
		|ПОМЕСТИТЬ Номинал
		|ИЗ
		|	РегистрНакопления.уп_НоминалВзносовОПС.Обороты(
		|			&ДатаНачалаВремен,
		|			&ДатаДок,
		|			Период,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ДоговорыОПС.ДоговорОПС
		|					ИЗ
		|						ДоговорыОПС КАК ДоговорыОПС)
		|				И Организация = &Организация) КАК уп_НоминалВзносовОПСОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НоминалВзносовОПСОбороты.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Номинал.ДоговорОПС, Резервы.ДоговорОПС) КАК ДоговорОПС,
		|	ЕСТЬNULL(Номинал.НоминалФиз, 0) КАК НоминалФиз,
		|	ЕСТЬNULL(Номинал.НоминалДоп, 0) КАК НоминалДоп,
		|	ЕСТЬNULL(Номинал.НоминалГП, 0) КАК НоминалГП,
		|	ЕСТЬNULL(Номинал.НоминалМК, 0) КАК НоминалМК,
		|	ЕСТЬNULL(Резервы.ВзносыФиз, 0) КАК ВзносыФиз,
		|	ЕСТЬNULL(Резервы.ВзносыДоп, 0) КАК ВзносыДоп,
		|	ЕСТЬNULL(Резервы.ГосПоддержка, 0) КАК ВзносыГП,
		|	ЕСТЬNULL(Резервы.МК, 0) КАК ВзносыМК
		|ИЗ
		|	Резервы КАК Резервы
		|		ПОЛНОЕ СОЕДИНЕНИЕ Номинал КАК Номинал
		|		ПО Резервы.ДоговорОПС = Номинал.ДоговорОПС";
		
		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("ДатаНачалаВремен", '20000101');
		Запрос.УстановитьПараметр("ТабДоговоров", ТабДоговоров);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		
		Результат = Запрос.Выполнить();
				
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			//проверяем не превышает ли сумма номинал
			Если (ВыборкаДетальныеЗаписи.ВзносыФиз+ВыборкаДетальныеЗаписи.ВзносыДоп+ВыборкаДетальныеЗаписи.ВзносыГП+ВыборкаДетальныеЗаписи.ВзносыМК)<
				(ВыборкаДетальныеЗаписи.НоминалФиз+ВыборкаДетальныеЗаписи.НоминалДоп+ВыборкаДетальныеЗаписи.НоминалГП+ВыборкаДетальныеЗаписи.НоминалМК) Тогда
				РазницаОбщая = (ВыборкаДетальныеЗаписи.НоминалФиз+ВыборкаДетальныеЗаписи.НоминалДоп+ВыборкаДетальныеЗаписи.НоминалГП+ВыборкаДетальныеЗаписи.НоминалМК)-(ВыборкаДетальныеЗаписи.ВзносыФиз+ВыборкаДетальныеЗаписи.ВзносыДоп+ВыборкаДетальныеЗаписи.ВзносыГП+ВыборкаДетальныеЗаписи.ВзносыМК);
				Если ВыборкаДетальныеЗаписи.ВзносыФиз<ВыборкаДетальныеЗаписи.НоминалФиз Тогда
					Разница = ВыборкаДетальныеЗаписи.НоминалФиз-ВыборкаДетальныеЗаписи.ВзносыФиз;
					Новстр = РасшифровкаСуммы.Добавить();
					НовСтр.ДоговорОПС = ДоговорОПС;
					НовСтр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз;
					НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
					ТекСумма = Мин(Разница,РазницаОбщая);
					НовСтр.Сумма = ТекСумма;
					РазницаОбщая = РазницаОбщая-ТекСумма;
				КонецЕсли;
				Если РазницаОбщая <> 0 Тогда
					Если ВыборкаДетальныеЗаписи.ВзносыДоп<ВыборкаДетальныеЗаписи.НоминалДоп Тогда
						Разница = ВыборкаДетальныеЗаписи.НоминалДоп-ВыборкаДетальныеЗаписи.ВзносыДоп;
						Новстр = РасшифровкаСуммы.Добавить();
						НовСтр.ДоговорОПС = ДоговорОПС;
						НовСтр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ДопВзносы;
						НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
						ТекСумма = Мин(Разница,РазницаОбщая);
						НовСтр.Сумма = ТекСумма;
						РазницаОбщая = РазницаОбщая-ТекСумма;
					КонецЕсли;
				КонецЕсли;
				Если РазницаОбщая <> 0 Тогда
					Если ВыборкаДетальныеЗаписи.ВзносыГП<ВыборкаДетальныеЗаписи.НоминалГП Тогда
						Разница = ВыборкаДетальныеЗаписи.НоминалГП-ВыборкаДетальныеЗаписи.ВзносыГП;
						Новстр = РасшифровкаСуммы.Добавить();
						НовСтр.ДоговорОПС = ДоговорОПС;
						НовСтр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ГосПоддержка;
						НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
						ТекСумма = Мин(Разница,РазницаОбщая);
						НовСтр.Сумма = ТекСумма;
						РазницаОбщая = РазницаОбщая-ТекСумма;
					КонецЕсли;
				КонецЕсли;
				Если РазницаОбщая <> 0 Тогда
					Если ВыборкаДетальныеЗаписи.ВзносыМК<ВыборкаДетальныеЗаписи.НоминалМК Тогда
						Разница = ВыборкаДетальныеЗаписи.НоминалМК-ВыборкаДетальныеЗаписи.ВзносыМК;
						Новстр = РасшифровкаСуммы.Добавить();
						НовСтр.ДоговорОПС = ДоговорОПС;
						НовСтр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал;
						НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
						ТекСумма = Мин(Разница,РазницаОбщая);
						НовСтр.Сумма = ТекСумма;
						РазницаОбщая = РазницаОбщая-ТекСумма;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если РазницаОбщая<>0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось восстановить резерв на сумму "+РазницаОбщая);
				//Сообщить("Не удалось восстановить резерв на сумму "+РазницаОбщая);
			КонецЕсли;	
		КонецЕсли;
		
		ВремТЗ = РасшифровкаСуммы.Выгрузить();
		ВремТЗ.Свернуть("ДоговорОПС","Сумма");
		Для Каждого ТекСтрока Из ДоговорыОПС Цикл
			Для Каждого ТекСтр Из ВремТЗ Цикл
				Если ТекСтрока.ДоговорОПС = ТекСтр.ДоговорОПС Тогда
					ТекСтрока.Сумма = ТекСтр.Сумма;	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	СуммаДокумента = ДоговорыОПС.Итог("Сумма");
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_pf_fond_npf_pfr(Отказ, Режим) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
		
	Для Каждого ТекСтрокаРасшифровкаСуммы Из РасшифровкаСуммы Цикл
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрокаРасшифровкаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводИзРезерваОПСВРезервНакоплений;
		
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаРасшифровкаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
//		Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
//		Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
//		Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводИзРезерваОПСВРезервНакоплений;
		
		Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрокаРасшифровкаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
	КонецЦикла;
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
	#КонецЕсли
КонецПроцедуры
